# Задание №2

# Дана строка, длина которой не превосходит 1000. Вам требуется преобразовать все идущие подряд пробелы в один. Выведите измененную строку.

str = "Это строка   с лишними   пробелами wss w   "

print(' '.join(str.split()))